// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = +prompt('Ведіть час ві 1хв.- до 59хв. ')
// if (time <= 15) {
//     console.log('Перша чверть годинни')
// } else if (time <= 30) {
//     console.log('Друга чверть годинни')
// }
// else if (time <= 45) {
//     console.log('Третя чверть годинни')
// } else if (time <= 59)
// {
//     console.log('Четверта чверть годинни')
// }


// У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('введіть день від 1 до 31')
// if (day <=15) {
//     console.log('перша декада')
// } else if (day <= 31) {
//     console.log('друга декада')
// } else if (day => 31) {
//     console.log('неправильно вказаний день')
// }

// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test ='';
// if (!test) {
//     console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО')
// }
// let test =!!''? 'НЕВІРНО':'ВІРНО'
// console.log(test);


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a =+prompt('Введіть число 1, 0 , -3');
// if (a !== 0) {
//     console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО')}
//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// let scheduleOfWeek = +prompt('Введіть день тижня від 1 до 7')
// //
// switch (scheduleOfWeek) {
//     case 1:
//         console.log('ПОНЕДІЛОК: 20:00 лекція');
//         break;
//     case 2:
//         console.log('ВІВТОРОК: 18:00 практика ');
//         break;
//     case 3:
//         console.log('СЕРЕДА:17:00 піти на тренування');
//         break;
//     case 4:
//         console.log('ЧЕТВЕР: 19:00 зустрітись з друзями');
//         break;
//     case 5:
//         console.log('ПЯТНИЦЯ: 20:00 забрати телефон');
//         break;
//     case 6:
//         console.log('СУБОТА: 10:00 піти в магазин');
//         break;
//     case 7:
//         console.log('НЕДІЛЯ: 20:00 здати д/з');
//         break;
//     default:
//         console.log('невірний день');
// }
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year =+prompt('Введіть кількість днів в цьому році')
// if (year % 2 === 0){
//     console.log('високосни')
// }else {
//     console.log('невисокосний')
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let name = prompt('Яка офіційна назва JavaScript? ')
// if (name === 'ECMAScript'){
//    alert('Правильно');
// }else {
//     alert('Неправильно')
//
// }
